{"modelTopology": {"keras_version": "2.1.6", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_2", "trainable": true, "batch_input_shape": [null, 40], "dtype": "float32", "input_dim": 7061, "output_dim": 25, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}}, {"class_name": "LSTM", "config": {"name": "lstm_2", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 50, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "units": 7061, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss": "categorical_crossentropy", "metrics": ["accuracy"], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "dense_2/kernel", "shape": [50, 7061], "dtype": "float32", "quantization": {"min": -0.64332701365153, "scale": 0.004730345688614191, "dtype": "uint8"}}, {"name": "dense_2/bias", "shape": [7061], "dtype": "float32", "quantization": {"min": -0.26310434718342385, "scale": 0.0012528778437305898, "dtype": "uint8"}}, {"name": "embedding_2/embeddings", "shape": [7061, 25], "dtype": "float32", "quantization": {"min": -0.11522489791991664, "scale": 0.0008795793734344781, "dtype": "uint8"}}, {"name": "lstm_2/kernel", "shape": [25, 200], "dtype": "float32", "quantization": {"min": -0.24556842411265656, "scale": 0.0018603668493383072, "dtype": "uint8"}}, {"name": "lstm_2/recurrent_kernel", "shape": [50, 200], "dtype": "float32", "quantization": {"min": -0.2989227196749519, "scale": 0.002372402537102793, "dtype": "uint8"}}, {"name": "lstm_2/bias", "shape": [200], "dtype": "float32", "quantization": {"min": -0.05211438273682314, "scale": 0.004342865228068595, "dtype": "uint8"}}]}]}